FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1756/LPC1756_I2C.c
            // Arbitration was lost
        case 0x38:
            // Generate a start condition and try again
            STA_SET(p);
            STO_CLEAR(p);
            break;

            // MASTER RECEIVER
            // Slave address + Read sent, ACK received
        case 0x40:
            // Are we to receive more?
            STA_CLEAR(p);
            STO_CLEAR(p);
            if ((p->iIndex + 1) >= p->iDataLen) {
                // No more needed.
                // return NACK for data byte
                AA_CLEAR(p);
            } else {
                // More bytes needed.
                // return ACK for data byte
                AA_SET(p);
            }
            break;

            // Slave address + Read sent, NO ACK received
        case 0x48:
            // Generate a stop condition
            STA_CLEAR(p);
            STO_SET(p);
            p->iRequest->iStatus = I2C_ERROR;
            p->iDoneFlag = ETrue;
            p->iCompleteFunc(p->iCompleteWorkspace, p->iRequest);
            break;

            // Data byte received with ACK
        case 0x50:
            // Store received byte
            c = I2DAT_READ(p);
            if (p->iIndex < p->iDataLen)
                p->iData[p->iIndex++] = c;

            // Are we to receive more?
            STA_CLEAR(p);
            STO_CLEAR(p);
            if ((p->iIndex + 1) >= p->iDataLen) {
                // return NACK for next data byte
                AA_CLEAR(p);
            } else {
                // return ACK for next data byte
                AA_SET(p);
            }
            break;

            // Data byte received with NACK (last byte)
        case 0x58:
            // Store last byte
            c = I2DAT_READ(p);
            if (p->iIndex < p->iDataLen)
                p->iData[p->iIndex++] = c;

            // Generate a stop condition, but report OK
            STA_CLEAR(p);
            STO_SET(p);
            p->iRequest->iStatus = I2C_OK;
            p->iDoneFlag = ETrue;
            p->iCompleteFunc(p->iCompleteWorkspace, p->iRequest);
            break;
#endif // COMPILE_I2C_MASTER_MODE
#if COMPILE_I2C_SLAVE_MODE
            // SLAVE RECEIVER
        case 0x60:
        case 0x68:
        case 0x70:
        case 0x78:
            // Start of slave transaction
            // slave address + W received, or general call address received,
            // or lost arbitration, slave address + W received, or
            // lost arbitration, general call address received.
            STA_CLEAR(p);
            STO_CLEAR(p);
            p->iIndex = 0;
            p->iDoneFlag = EFalse;
            // Is this the last byte?
            if (p->iI2CSlaveIsLastReceiveByte(p->iI2CSlaveCallbackWorkspace)) {
                // Not allowed to send more bytes
                AA_CLEAR(p);
            } else {
                // Allowed to send more bytes
                AA_SET(p);
            }
            break;
        case 0x80:
        case 0x90:
            // Data received
            p->iI2CSlaveReceiveByte(p->iI2CSlaveCallbackWorkspace, I2DAT_READ(p));
            p->iIndex++;
            STA_CLEAR(p);
            STO_CLEAR(p);
            // Is this the last byte?
            if (p->iI2CSlaveIsLastReceiveByte(p->iI2CSlaveCallbackWorkspace)) {
                // Not allowed to send more bytes
                AA_CLEAR(p);
            } else {
                // Allowed to send more bytes
                AA_SET(p);
            }
            break;
        case 0x88:
        case 0x98:
            // Data received, NACK returned (signaling last byte)
            p->iI2CSlaveReceiveByte(p->iI2CSlaveCallbackWorkspace,
                I2DAT_READ(p));
            p->iIndex++;
            //p->iRequest->iStatus = I2C_OK;
            STA_CLEAR(p);
            STO_CLEAR(p);
            AA_SET(p);
            p->iDoneFlag = ETrue;
            p->iI2CSlaveTransferComplete(p->iI2CSlaveCallbackWorkspace);
            break;
        case 0xA0:
            // Stop condition received
            //p->iRequest->iStatus = I2C_OK; 
            STA_CLEAR(p);
            STO_CLEAR(p);
            AA_SET(p);
            p->iDoneFlag = ETrue;
            p->iI2CSlaveTransferComplete(p->iI2CSlaveCallbackWorkspace);
            break;

            // SLAVE TRANSMITTER 
            // ACK returned on Slave Address + R received; or
            // arbitration lost, slave address + R received, ACK returned; or
            // data byte transmitted, ACK received
        case 0xA8:
        case 0xB0:
            p->iIndex = 0;
        case 0xB8:
            c = p->iI2CSlaveGetTransmitByte(p->iI2CSlaveCallbackWorkspace);
            p->iIndex++;
            I2DAT_WRITE(p, c);
            STA_CLEAR(p);
            STO_CLEAR(p);
            if (p->iI2CSlaveIsLastTransmitByte(p->iI2CSlaveCallbackWorkspace)) {
                // No more data
                AA_CLEAR(p);
            } else {
                // more data bytes to transmit
                AA_SET(p);
            }
            break;
        case 0xC0:
        case 0xC8:
            // data byte transmitted, NACK received
            // last data byte transmitted, NACK received
            //p->iRequest->iStatus = I2C_OK;
            STA_CLEAR(p);
            STO_CLEAR(p);
            AA_SET(p);
            p->iDoneFlag = ETrue;
            p->iI2CSlaveTransferComplete(p->iI2CSlaveCallbackWorkspace);
            break;
#endif // #if COMPILE_I2C_SLAVE_MODE
            // Unhandled state
        default:
            // Generate a stop condition
            STA_CLEAR(p);
            STO_CLEAR(p);
            AA_SET(p);
            //p->iRequest->iStatus = I2C_ERROR;
            p->iDoneFlag = ETrue;
#if COMPILE_I2C_SLAVE_MODE
            p->iI2CSlaveTransferComplete(p->iI2CSlaveCallbackWorkspace);
#endif
            if (p->iCompleteFunc)
                p->iCompleteFunc(p->iCompleteWorkspace, p->iRequest);
            break;
    }

    // clear interrupt flag
    SI_CLEAR(p);
}

/*---------------------------------------------------------------------------*
 * Routine:  ILPC1756_ConfigureSlave
 *---------------------------------------------------------------------------*/
/**
 *  Configure the I2C Slave callback functions and callback workspace.
 *      Must call Enable in order to enable slave commands.
 *
 *  @param [in]    *aWorkspace 				I2C Workspace
 *
 *  @param [in]    aAddressLower7Bits 		Slave address to receive I2C commands
 *
 *  @param [in]    *aCallbackWorkspace 		Callback's workspace, or 0 for none
 *
 *  @param [in]    *aCallbacks 				List of callback functions
 *
 *  @return        T_uezError 				Error code
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
T_uezError ILPC1756_ConfigureSlave(
    void *aWorkspace,
    TUInt8 aAddressLower7Bits,
    void *aCallbackWorkspace,
    const T_I2CSlaveCallbacks *aCallbacks)
{
    T_LPC1756_I2C_Workspace *p = (T_LPC1756_I2C_Workspace *)aWorkspace;

    p->iI2CSlaveIsLastReceiveByte = aCallbacks->iIsLastReceiveByteCallback;
    p->iI2CSlaveIsLastTransmitByte = aCallbacks->iIsLastTransmitByteCallback;
    p->iI2CSlaveReceiveByte = aCallbacks->iReceiveByteCallback;
    p->iI2CSlaveGetTransmitByte = aCallbacks->iGetTransmitByteCallback;
    p->iI2CSlaveTransferComplete = aCallbacks->iTransferCompleteCallback;
    p->iI2CSlaveCallbackWorkspace = aCallbackWorkspace;

    I2C_SET_MASK0(p, 0xFE);
    I2C_SET_ADDR0(p, (aAddressLower7Bits<<1));

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  ILPC1756_Enable
 *---------------------------------------------------------------------------*/
/**
 *  Enables the I2C channel.
 *
 *  @param [in]    *aWorkspace 		I2C Workspace
 *
 *  @return        T_uezError		Error code
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
T_uezError ILPC1756_Enable(void *aWorkspace)
{
    T_LPC1756_I2C_Workspace *p = (T_LPC1756_I2C_Workspace *)aWorkspace;

    I2C_ENABLE(p);
    AA_SET(p);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  ILPC1756_Disable
 *---------------------------------------------------------------------------*/
/**
 *  Disables the I2C channel.
 *
 *  @param [in]    *aWorkspace 			I2C Workspace
 *
 *  @return        T_uezError 			Error code
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
T_uezError ILPC1756_Disable(void *aWorkspace)
{
    T_LPC1756_I2C_Workspace *p = (T_LPC1756_I2C_Workspace *)aWorkspace;

    I2C_DISABLE(p);

    return UEZ_ERROR_NONE;
}

