FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1756/LPC1756_I2C.c
T_uezError ILPC1756_I2C_IsHung(void *aWorkspace, TBool *aBool)
{
    T_uezError error = UEZ_ERROR_NONE;
    T_LPC1756_I2C_Workspace *p = (T_LPC1756_I2C_Workspace *)aWorkspace;
    TBool sda, scl;

    sda = UEZGPIORead(p->iSDAPin);
    scl = UEZGPIORead(p->iSCLPin);

    *aBool = (!scl || !sda) ? ETrue : EFalse;

    return error;
}

T_uezError ILPC1756_I2C_ResetBus(void *aWorkspace)
{
    T_uezError error = UEZ_ERROR_NONE;
    //T_LPC1756_I2C_Workspace *p = (T_LPC1756_I2C_Workspace *)aWorkspace;
    //TODO: implement reset functionality.

    return error;
}

IRQ_ROUTINE(ILPC1756_I2C1InterruptHandler)
{
    IRQ_START();
    ILPC1756_ProcessState(G_lpc1756_i2c1Workspace);
    IRQ_END();
}

IRQ_ROUTINE(ILPC1756_I2C2InterruptHandler)
{
    IRQ_START();
    ILPC1756_ProcessState(G_lpc1756_i2c2Workspace);
    IRQ_END();
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1756_I2C_Bus1_InitializeWorkspace
 *---------------------------------------------------------------------------*/
/**
 *  Setup the LPC1756 I2C Bus1 workspace.
 *
 *  @param [in]    *aWorkspace  	Particular I2C workspace
 *
 *  @return        T_uezError   	Error code
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
T_uezError LPC1756_I2C_Bus1_InitializeWorkspace(void *aWorkspace)
{
    T_LPC1756_I2C_Workspace *p = (T_LPC1756_I2C_Workspace *)aWorkspace;
    p->iRegs = I2C1;
    p->iDoneFlag = ETrue;
    p->iCompleteFunc = 0;
    G_lpc1756_i2c1Workspace = p;

    // Setup interrupt vector
    InterruptRegister(I2C1_IRQn, ILPC1756_I2C1InterruptHandler,
        INTERRUPT_PRIORITY_NORMAL, "I2C1");
    InterruptEnable(I2C1_IRQn);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1756_I2C_Bus2_InitializeWorkspace
 *---------------------------------------------------------------------------*/
/**
 *  Setup the LPC1756 I2C Bus2 workspace.
 *
 *  @param [in]    *aWorkspace    	Particular I2C workspace
 *
 *  @return        T_uezError      	Error code
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
T_uezError LPC1756_I2C_Bus2_InitializeWorkspace(void *aWorkspace)
{
    T_LPC1756_I2C_Workspace *p = (T_LPC1756_I2C_Workspace *)aWorkspace;
    p->iRegs = I2C2;
    p->iDoneFlag = ETrue;
    p->iCompleteFunc = 0;
    G_lpc1756_i2c2Workspace = p;

    // Setup interrupt vector
    InterruptRegister(I2C2_IRQn, ILPC1756_I2C2InterruptHandler,
        INTERRUPT_PRIORITY_NORMAL, "I2C2");
    InterruptEnable(I2C2_IRQn);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * HAL Interface tables:
 *---------------------------------------------------------------------------*/
const HAL_I2CBus I2C_LPC1756_Bus1_Interface = {
    {
        "LPC1756 I2C Bus1",
        0x0100,
        LPC1756_I2C_Bus1_InitializeWorkspace,
        sizeof(T_LPC1756_I2C_Workspace), },

    ILPC1756_I2C_StartRead,
    ILPC1756_I2C_StartWrite,
    ILPC1756_ConfigureSlave,
    ILPC1756_Enable,
    ILPC1756_Disable,
    ILPC1756_I2C_IsHung, ILPC1756_I2C_ResetBus};

const HAL_I2CBus I2C_LPC1756_Bus2_Interface = {
    {
        "LPC1756 I2C Bus2",
        0x0100,
        LPC1756_I2C_Bus2_InitializeWorkspace,
        sizeof(T_LPC1756_I2C_Workspace), },

    ILPC1756_I2C_StartRead,
    ILPC1756_I2C_StartWrite,
    ILPC1756_ConfigureSlave,
    ILPC1756_Enable,
    ILPC1756_Disable,
    ILPC1756_I2C_IsHung, ILPC1756_I2C_ResetBus};

/*---------------------------------------------------------------------------*
 * Requirement routines:
 *---------------------------------------------------------------------------*/
void LPC1756_I2C1_Require(T_uezGPIOPortPin aPinSDA1, T_uezGPIOPortPin aPinSCL1)
{
    T_LPC1756_I2C_Workspace *p;

    HAL_DEVICE_REQUIRE_ONCE();

    /** Register I2C Bus driver */
    HALInterfaceRegister("I2C1", (T_halInterface *)&I2C_LPC1756_Bus1_Interface,
        0, (T_halWorkspace **)&p);
    LPC1756_IOCON_ConfigPin(aPinSDA1, G_sda1, ARRAY_COUNT(G_sda1));
    LPC1756_IOCON_ConfigPin(aPinSCL1, G_scl1, ARRAY_COUNT(G_scl1));
    p->iSCLPin = aPinSCL1;
    p->iSDAPin = aPinSDA1;
}

void LPC1756_I2C2_Require(T_uezGPIOPortPin aPinSDA2, T_uezGPIOPortPin aPinSCL2)
{
    T_LPC1756_I2C_Workspace *p;

    HAL_DEVICE_REQUIRE_ONCE();

    /** Register I2C Bus driver */
    HALInterfaceRegister("I2C2", (T_halInterface *)&I2C_LPC1756_Bus2_Interface,
        0, (T_halWorkspace **)&p);

    LPC1756_IOCON_ConfigPin(aPinSDA2, G_sda2, ARRAY_COUNT(G_sda2));
    LPC1756_IOCON_ConfigPin(aPinSCL2, G_scl2, ARRAY_COUNT(G_scl2));
    p->iSCLPin = aPinSCL2;
    p->iSDAPin = aPinSDA2;
}
/*-------------------------------------------------------------------------*
 * End of File:  LPC1756_I2C.c
 *-------------------------------------------------------------------------*/
